[1mContext nucleotides: 10000[0m
[1mSequence length (output): 5000[0m
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, 4)]    0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 32)     160         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, None, 32)     128         conv1d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, None, 32)     0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 32)     11296       activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 32)     128         conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, 32)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 32)     11296       activation_1[0][0]               
__________________________________________________________________________________________________
add (Add)                       (None, None, 32)     0           conv1d_3[0][0]                   
                                                                 conv1d[0][0]                     
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 32)     128         add[0][0]                        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, 32)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 32)     11296       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 32)     128         conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, 32)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 32)     11296       activation_3[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 32)     0           conv1d_5[0][0]                   
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 32)     128         add_1[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, 32)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 32)     11296       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 32)     128         conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, 32)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, None, 32)     11296       activation_5[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, 32)     0           conv1d_7[0][0]                   
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, 32)     128         add_2[0][0]                      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, 32)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, None, 32)     11296       activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, 32)     128         conv1d_8[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, 32)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, None, 32)     11296       activation_7[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, 32)     0           conv1d_9[0][0]                   
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, 32)     128         add_3[0][0]                      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, 32)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, None, 32)     11296       activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, 32)     128         conv1d_11[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, 32)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, None, 32)     11296       activation_9[0][0]               
__________________________________________________________________________________________________
add_5 (Add)                     (None, None, 32)     0           conv1d_12[0][0]                  
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, 32)     128         add_5[0][0]                      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, None, 32)     0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, None, 32)     11296       activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, 32)     128         conv1d_13[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, 32)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, None, 32)     11296       activation_11[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, None, 32)     0           conv1d_14[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, None, 32)     128         add_6[0][0]                      
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, 32)     0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, None, 32)     11296       activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, 32)     128         conv1d_15[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, 32)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, None, 32)     11296       activation_13[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, None, 32)     0           conv1d_16[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, None, 32)     128         add_7[0][0]                      
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, 32)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, None, 32)     11296       activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, None, 32)     128         conv1d_17[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, None, 32)     0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, None, 32)     11296       activation_15[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, None, 32)     0           conv1d_18[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, None, 32)     128         add_8[0][0]                      
__________________________________________________________________________________________________
activation_16 (Activation)      (None, None, 32)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, None, 32)     21536       activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, None, 32)     128         conv1d_20[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, None, 32)     0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, None, 32)     21536       activation_17[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, None, 32)     0           conv1d_21[0][0]                  
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, None, 32)     128         add_10[0][0]                     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, None, 32)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, None, 32)     21536       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, None, 32)     128         conv1d_22[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, None, 32)     0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, None, 32)     21536       activation_19[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, None, 32)     0           conv1d_23[0][0]                  
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, None, 32)     128         add_11[0][0]                     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, None, 32)     0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, None, 32)     21536       activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, None, 32)     128         conv1d_24[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, None, 32)     0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, None, 32)     21536       activation_21[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, None, 32)     0           conv1d_25[0][0]                  
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, None, 32)     128         add_12[0][0]                     
__________________________________________________________________________________________________
activation_22 (Activation)      (None, None, 32)     0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, None, 32)     21536       activation_22[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, None, 32)     128         conv1d_26[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, None, 32)     0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, None, 32)     21536       activation_23[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, None, 32)     0           conv1d_27[0][0]                  
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, None, 32)     128         add_13[0][0]                     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, None, 32)     0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, None, 32)     42016       activation_24[0][0]              
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, None, 32)     128         conv1d_29[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, None, 32)     0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, None, 32)     42016       activation_25[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, None, 32)     0           conv1d_30[0][0]                  
                                                                 add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, None, 32)     128         add_15[0][0]                     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, None, 32)     0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, None, 32)     42016       activation_26[0][0]              
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, None, 32)     128         conv1d_31[0][0]                  
__________________________________________________________________________________________________
activation_27 (Activation)      (None, None, 32)     0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, None, 32)     42016       activation_27[0][0]              
__________________________________________________________________________________________________
add_16 (Add)                    (None, None, 32)     0           conv1d_32[0][0]                  
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, None, 32)     128         add_16[0][0]                     
__________________________________________________________________________________________________
activation_28 (Activation)      (None, None, 32)     0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv1d_33 (Conv1D)              (None, None, 32)     42016       activation_28[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, None, 32)     128         conv1d_33[0][0]                  
__________________________________________________________________________________________________
activation_29 (Activation)      (None, None, 32)     0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv1d_34 (Conv1D)              (None, None, 32)     42016       activation_29[0][0]              
__________________________________________________________________________________________________
add_17 (Add)                    (None, None, 32)     0           conv1d_34[0][0]                  
                                                                 add_16[0][0]                     
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, None, 32)     128         add_17[0][0]                     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, None, 32)     0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv1d_35 (Conv1D)              (None, None, 32)     42016       activation_30[0][0]              
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, None, 32)     128         conv1d_35[0][0]                  
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 32)     1056        conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, None, 32)     1056        add_3[0][0]                      
__________________________________________________________________________________________________
activation_31 (Activation)      (None, None, 32)     0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, 32)     0           conv1d_1[0][0]                   
                                                                 conv1d_10[0][0]                  
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, None, 32)     1056        add_8[0][0]                      
__________________________________________________________________________________________________
conv1d_36 (Conv1D)              (None, None, 32)     42016       activation_31[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, None, 32)     0           add_4[0][0]                      
                                                                 conv1d_19[0][0]                  
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, None, 32)     1056        add_13[0][0]                     
__________________________________________________________________________________________________
add_18 (Add)                    (None, None, 32)     0           conv1d_36[0][0]                  
                                                                 add_17[0][0]                     
__________________________________________________________________________________________________
add_14 (Add)                    (None, None, 32)     0           add_9[0][0]                      
                                                                 conv1d_28[0][0]                  
__________________________________________________________________________________________________
conv1d_37 (Conv1D)              (None, None, 32)     1056        add_18[0][0]                     
__________________________________________________________________________________________________
add_19 (Add)                    (None, None, 32)     0           add_14[0][0]                     
                                                                 conv1d_37[0][0]                  
__________________________________________________________________________________________________
cropping1d (Cropping1D)         (None, None, 32)     0           add_19[0][0]                     
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, None, 32)     128         cropping1d[0][0]                 
__________________________________________________________________________________________________
conv1d_38 (Conv1D)              (None, None, 3)      99          batch_normalization_32[0][0]     
==================================================================================================
Total params: 698,915
Trainable params: 696,803
Non-trainable params: 2,112
__________________________________________________________________________________________________
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9650	[91m0.8036	[0m0.9351	0.9719	[94m0.8722	[0m0.9569	0.5190	0.0646	0.0102	14167

[1mDonor:[0m
0.9634	[91m0.8263	[0m0.9553	0.9827	[94m0.8924	[0m0.8401	0.2547	0.0241	0.0041	14167

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9671	[91m0.8086	[0m0.9342	0.9707	[94m0.8764	[0m0.9573	0.5059	0.0609	0.0098	11967

[1mDonor:[0m
0.9692	[91m0.8360	[0m0.9567	0.9801	[94m0.8992	[0m0.8541	0.2592	0.0231	0.0040	11966
Learning rate: 0.00100
--- 1208.2269434928894 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9877	[91m0.8970	[0m0.9790	0.9899	[94m0.9498	[0m0.9844	0.4749	0.0183	0.0029	14167

[1mDonor:[0m
0.9904	[91m0.9027	[0m0.9853	0.9921	[94m0.9551	[0m0.9762	0.4267	0.0134	0.0020	14167

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9916	[91m0.8939	[0m0.9777	0.9874	[94m0.9495	[0m0.9832	0.4665	0.0182	0.0028	11967

[1mDonor:[0m
0.9900	[91m0.9057	[0m0.9823	0.9899	[94m0.9541	[0m0.9760	0.4265	0.0130	0.0019	11966
Learning rate: 0.00100
--- 1281.890197277069 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9322	[91m0.7724	[0m0.9390	0.9814	[94m0.8461	[0m0.9869	0.9613	0.8656	0.6388	14167

[1mDonor:[0m
0.9802	[91m0.8780	[0m0.9798	0.9919	[94m0.9350	[0m1.0000	1.0000	0.9995	0.9959	14167

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9311	[91m0.7695	[0m0.9336	0.9763	[94m0.8403	[0m0.9868	0.9606	0.8635	0.6378	11967

[1mDonor:[0m
0.9843	[91m0.8782	[0m0.9789	0.9897	[94m0.9359	[0m1.0000	1.0000	0.9995	0.9959	11966
Learning rate: 0.00100
--- 1264.2316164970398 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9808	[91m0.8529	[0m0.9561	0.9778	[94m0.9132	[0m0.9960	0.9818	0.9464	0.9040	14167

[1mDonor:[0m
0.9325	[91m0.7622	[0m0.9152	0.9675	[94m0.8283	[0m1.0000	1.0000	0.9998	0.9996	14167

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9841	[91m0.8522	[0m0.9503	0.9722	[94m0.9108	[0m0.9961	0.9822	0.9477	0.9064	11967

[1mDonor:[0m
0.9308	[91m0.7626	[0m0.9183	0.9667	[94m0.8300	[0m1.0000	1.0000	0.9998	0.9996	11966
Learning rate: 0.00100
--- 1183.5953569412231 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9287	[91m0.7487	[0m0.8970	0.9545	[94m0.8118	[0m0.0004	0.0002	0.0001	0.0000	14167

[1mDonor:[0m
0.9739	[91m0.8396	[0m0.9556	0.9831	[94m0.8949	[0m1.0000	1.0000	1.0000	0.9999	14167

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9234	[91m0.7409	[0m0.8905	0.9485	[94m0.8035	[0m0.0004	0.0002	0.0001	0.0000	11967

[1mDonor:[0m
0.9731	[91m0.8416	[0m0.9551	0.9807	[94m0.8956	[0m1.0000	1.0000	1.0000	0.9999	11966
Learning rate: 0.00100
--- 1259.7805230617523 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.8064	[91m0.6049	[0m0.7717	0.8806	[94m0.6437	[0m0.0208	0.0113	0.0063	0.0037	14167

[1mDonor:[0m
0.7226	[91m0.5682	[0m0.7542	0.8793	[94m0.5521	[0m1.0000	1.0000	1.0000	1.0000	14167

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.8009	[91m0.6054	[0m0.7707	0.8789	[94m0.6393	[0m0.0206	0.0112	0.0062	0.0036	11967

[1mDonor:[0m
0.7177	[91m0.5624	[0m0.7556	0.8857	[94m0.5490	[0m1.0000	1.0000	1.0000	1.0000	11966
Learning rate: 0.00100
--- 1230.6558017730713 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.7733	[91m0.5780	[0m0.7369	0.8482	[94m0.5976	[0m0.1199	0.0730	0.0453	0.0289	14167

[1mDonor:[0m
0.6689	[91m0.5211	[0m0.7033	0.8444	[94m0.5056	[0m1.0000	1.0000	1.0000	1.0000	14167

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.7688	[91m0.5763	[0m0.7305	0.8416	[94m0.5967	[0m0.1183	0.0723	0.0452	0.0289	11967

[1mDonor:[0m
0.6666	[91m0.5184	[0m0.7046	0.8432	[94m0.5030	[0m1.0000	1.0000	1.0000	1.0000	11966
Learning rate: 0.00050
--- 1194.1443989276886 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0030	[91m0.0015	[0m0.0015	0.0015	[94m0.0008	[0m0.0000	0.0000	0.0000	0.0000	14167

[1mDonor:[0m
0.1295	[91m0.0776	[0m0.1172	0.3103	[94m0.0705	[0m1.0000	1.0000	0.9999	0.9994	14167

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0043	[91m0.0022	[0m0.0022	0.0022	[94m0.0017	[0m0.0000	0.0000	0.0000	0.0000	11967

[1mDonor:[0m
0.1850	[91m0.1671	[0m0.3599	0.4538	[94m0.1278	[0m1.0000	0.9999	0.9993	0.9986	11966
Learning rate: 0.00025
--- 1233.116195678711 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0001	[91m0.0001	[0m0.0001	0.0001	[94m0.0003	[0m0.0000	0.0000	0.0000	0.0000	14167

[1mDonor:[0m
0.0006	[91m0.0004	[0m0.0004	0.0004	[94m0.0002	[0m0.0000	0.0000	0.0000	0.0000	14167

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0008	[0m0.0012	0.0021	[94m0.0002	[0m0.0000	0.0000	0.0000	0.0000	11967

[1mDonor:[0m
0.0002	[91m0.0007	[0m0.0013	0.0021	[94m0.0002	[0m0.0000	0.0000	0.0000	0.0000	11966
Learning rate: 0.00013
--- 1276.6157088279724 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.5179	[91m0.3635	[0m0.4658	0.5625	[94m0.3018	[0m0.9999	0.9999	0.9998	0.9996	14167

[1mDonor:[0m
0.8338	[91m0.6341	[0m0.7965	0.8914	[94m0.6736	[0m0.9961	0.9855	0.9561	0.8857	14167

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.4961	[91m0.3409	[0m0.4320	0.5188	[94m0.2726	[0m0.9999	0.9999	0.9998	0.9996	11967

[1mDonor:[0m
0.8502	[91m0.6493	[0m0.8067	0.9009	[94m0.6938	[0m0.9962	0.9852	0.9544	0.8803	11966
Learning rate: 0.00006
--- 1148.8538146018982 seconds ---
--------------------------------------------------------------
