[1mContext nucleotides: 10000[0m
[1mSequence length (output): 5000[0m
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, 4)]    0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 32)     160         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, None, 32)     128         conv1d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, None, 32)     0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 32)     11296       activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 32)     128         conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, 32)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 32)     11296       activation_1[0][0]               
__________________________________________________________________________________________________
add (Add)                       (None, None, 32)     0           conv1d_3[0][0]                   
                                                                 conv1d[0][0]                     
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 32)     128         add[0][0]                        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, 32)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 32)     11296       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 32)     128         conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, 32)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 32)     11296       activation_3[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 32)     0           conv1d_5[0][0]                   
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 32)     128         add_1[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, 32)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 32)     11296       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 32)     128         conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, 32)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, None, 32)     11296       activation_5[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, 32)     0           conv1d_7[0][0]                   
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, 32)     128         add_2[0][0]                      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, 32)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, None, 32)     11296       activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, 32)     128         conv1d_8[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, 32)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, None, 32)     11296       activation_7[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, 32)     0           conv1d_9[0][0]                   
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, 32)     128         add_3[0][0]                      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, 32)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, None, 32)     11296       activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, 32)     128         conv1d_11[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, 32)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, None, 32)     11296       activation_9[0][0]               
__________________________________________________________________________________________________
add_5 (Add)                     (None, None, 32)     0           conv1d_12[0][0]                  
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, 32)     128         add_5[0][0]                      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, None, 32)     0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, None, 32)     11296       activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, 32)     128         conv1d_13[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, 32)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, None, 32)     11296       activation_11[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, None, 32)     0           conv1d_14[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, None, 32)     128         add_6[0][0]                      
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, 32)     0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, None, 32)     11296       activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, 32)     128         conv1d_15[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, 32)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, None, 32)     11296       activation_13[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, None, 32)     0           conv1d_16[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, None, 32)     128         add_7[0][0]                      
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, 32)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, None, 32)     11296       activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, None, 32)     128         conv1d_17[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, None, 32)     0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, None, 32)     11296       activation_15[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, None, 32)     0           conv1d_18[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, None, 32)     128         add_8[0][0]                      
__________________________________________________________________________________________________
activation_16 (Activation)      (None, None, 32)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, None, 32)     21536       activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, None, 32)     128         conv1d_20[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, None, 32)     0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, None, 32)     21536       activation_17[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, None, 32)     0           conv1d_21[0][0]                  
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, None, 32)     128         add_10[0][0]                     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, None, 32)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, None, 32)     21536       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, None, 32)     128         conv1d_22[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, None, 32)     0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, None, 32)     21536       activation_19[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, None, 32)     0           conv1d_23[0][0]                  
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, None, 32)     128         add_11[0][0]                     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, None, 32)     0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, None, 32)     21536       activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, None, 32)     128         conv1d_24[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, None, 32)     0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, None, 32)     21536       activation_21[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, None, 32)     0           conv1d_25[0][0]                  
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, None, 32)     128         add_12[0][0]                     
__________________________________________________________________________________________________
activation_22 (Activation)      (None, None, 32)     0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, None, 32)     21536       activation_22[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, None, 32)     128         conv1d_26[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, None, 32)     0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, None, 32)     21536       activation_23[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, None, 32)     0           conv1d_27[0][0]                  
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, None, 32)     128         add_13[0][0]                     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, None, 32)     0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, None, 32)     42016       activation_24[0][0]              
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, None, 32)     128         conv1d_29[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, None, 32)     0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, None, 32)     42016       activation_25[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, None, 32)     0           conv1d_30[0][0]                  
                                                                 add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, None, 32)     128         add_15[0][0]                     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, None, 32)     0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, None, 32)     42016       activation_26[0][0]              
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, None, 32)     128         conv1d_31[0][0]                  
__________________________________________________________________________________________________
activation_27 (Activation)      (None, None, 32)     0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, None, 32)     42016       activation_27[0][0]              
__________________________________________________________________________________________________
add_16 (Add)                    (None, None, 32)     0           conv1d_32[0][0]                  
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, None, 32)     128         add_16[0][0]                     
__________________________________________________________________________________________________
activation_28 (Activation)      (None, None, 32)     0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv1d_33 (Conv1D)              (None, None, 32)     42016       activation_28[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, None, 32)     128         conv1d_33[0][0]                  
__________________________________________________________________________________________________
activation_29 (Activation)      (None, None, 32)     0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv1d_34 (Conv1D)              (None, None, 32)     42016       activation_29[0][0]              
__________________________________________________________________________________________________
add_17 (Add)                    (None, None, 32)     0           conv1d_34[0][0]                  
                                                                 add_16[0][0]                     
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, None, 32)     128         add_17[0][0]                     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, None, 32)     0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv1d_35 (Conv1D)              (None, None, 32)     42016       activation_30[0][0]              
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, None, 32)     128         conv1d_35[0][0]                  
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 32)     1056        conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, None, 32)     1056        add_3[0][0]                      
__________________________________________________________________________________________________
activation_31 (Activation)      (None, None, 32)     0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, 32)     0           conv1d_1[0][0]                   
                                                                 conv1d_10[0][0]                  
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, None, 32)     1056        add_8[0][0]                      
__________________________________________________________________________________________________
conv1d_36 (Conv1D)              (None, None, 32)     42016       activation_31[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, None, 32)     0           add_4[0][0]                      
                                                                 conv1d_19[0][0]                  
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, None, 32)     1056        add_13[0][0]                     
__________________________________________________________________________________________________
add_18 (Add)                    (None, None, 32)     0           conv1d_36[0][0]                  
                                                                 add_17[0][0]                     
__________________________________________________________________________________________________
add_14 (Add)                    (None, None, 32)     0           add_9[0][0]                      
                                                                 conv1d_28[0][0]                  
__________________________________________________________________________________________________
conv1d_37 (Conv1D)              (None, None, 32)     1056        add_18[0][0]                     
__________________________________________________________________________________________________
add_19 (Add)                    (None, None, 32)     0           add_14[0][0]                     
                                                                 conv1d_37[0][0]                  
__________________________________________________________________________________________________
cropping1d (Cropping1D)         (None, None, 32)     0           add_19[0][0]                     
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, None, 32)     128         cropping1d[0][0]                 
__________________________________________________________________________________________________
conv1d_38 (Conv1D)              (None, None, 3)      99          batch_normalization_32[0][0]     
==================================================================================================
Total params: 698,915
Trainable params: 696,803
Non-trainable params: 2,112
__________________________________________________________________________________________________
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9508	[91m0.7736	[0m0.9105	0.9553	[94m0.8396	[0m0.9171	0.4959	0.0974	0.0197	12852

[1mDonor:[0m
0.9489	[91m0.7923	[0m0.9341	0.9730	[94m0.8578	[0m0.8682	0.3639	0.0530	0.0103	12851

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9571	[91m0.7799	[0m0.9175	0.9644	[94m0.8507	[0m0.9312	0.5636	0.1316	0.0272	14792

[1mDonor:[0m
0.9529	[91m0.7971	[0m0.9410	0.9788	[94m0.8686	[0m0.8811	0.4143	0.0652	0.0130	14792
Learning rate: 0.00100
--- 1330.2020893096924 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9795	[91m0.8729	[0m0.9675	0.9816	[94m0.9267	[0m0.3681	0.0187	0.0007	0.0001	12852

[1mDonor:[0m
0.9807	[91m0.8789	[0m0.9721	0.9854	[94m0.9324	[0m0.4489	0.0246	0.0007	0.0001	12851

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9835	[91m0.8787	[0m0.9748	0.9888	[94m0.9372	[0m0.3918	0.0218	0.0008	0.0001	14792

[1mDonor:[0m
0.9862	[91m0.8865	[0m0.9809	0.9912	[94m0.9448	[0m0.4559	0.0269	0.0008	0.0001	14792
Learning rate: 0.00100
--- 1559.2903118133545 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9555	[91m0.8035	[0m0.9386	0.9736	[94m0.8683	[0m1.0000	0.9999	0.9989	0.9926	12852

[1mDonor:[0m
0.9616	[91m0.8188	[0m0.9467	0.9781	[94m0.8818	[0m1.0000	1.0000	0.9998	0.9979	12851

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9661	[91m0.8196	[0m0.9506	0.9811	[94m0.8868	[0m1.0000	0.9999	0.9990	0.9935	14792

[1mDonor:[0m
0.9719	[91m0.8240	[0m0.9539	0.9845	[94m0.8961	[0m1.0000	1.0000	0.9998	0.9981	14792
Learning rate: 0.00100
--- 1383.6818006038666 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.4115	[91m0.4136	[0m0.8316	0.9501	[94m0.3963	[0m1.0000	1.0000	1.0000	1.0000	12852

[1mDonor:[0m
0.9617	[91m0.8185	[0m0.9469	0.9742	[94m0.8811	[0m0.8921	0.6327	0.2941	0.1332	12851

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.3737	[91m0.3812	[0m0.7579	0.9603	[94m0.3645	[0m1.0000	1.0000	1.0000	1.0000	14792

[1mDonor:[0m
0.9713	[91m0.8194	[0m0.9463	0.9786	[94m0.8894	[0m0.8994	0.6573	0.3306	0.1578	14792
Learning rate: 0.00100
--- 1338.3722476959229 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0000	[0m0.0002	0.0005	[94m0.0002	[0m0.0000	0.0000	0.0000	0.0000	12852

[1mDonor:[0m
0.0002	[91m0.0001	[0m0.0002	0.0006	[94m0.0002	[0m1.0000	1.0000	1.0000	1.0000	12851

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0001	[0m0.0001	0.0003	[94m0.0001	[0m0.0000	0.0000	0.0000	0.0000	14792

[1mDonor:[0m
0.0000	[91m0.0001	[0m0.0001	0.0003	[94m0.0001	[0m1.0000	1.0000	1.0000	1.0000	14792
Learning rate: 0.00100
--- 1337.1315124034882 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0000	[0m0.0002	0.0005	[94m0.0002	[0m0.0000	0.0000	0.0000	0.0000	12852

[1mDonor:[0m
0.0002	[91m0.0001	[0m0.0002	0.0006	[94m0.0002	[0m1.0000	1.0000	1.0000	1.0000	12851

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0001	[0m0.0001	0.0003	[94m0.0001	[0m0.0000	0.0000	0.0000	0.0000	14792

[1mDonor:[0m
0.0000	[91m0.0001	[0m0.0001	0.0003	[94m0.0001	[0m1.0000	1.0000	1.0000	1.0000	14792
Learning rate: 0.00100
--- 1153.1109428405762 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0002	[0m0.0005	0.0012	[94m0.0021	[0m0.0865	0.0781	0.0697	0.0613	12852

[1mDonor:[0m
0.0000	[91m0.0001	[0m0.0009	0.0022	[94m0.0030	[0m0.0595	0.0538	0.0480	0.0422	12851

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0001	[0m0.0005	0.0020	[94m0.0021	[0m0.0814	0.0723	0.0638	0.0565	14792

[1mDonor:[0m
0.0001	[91m0.0003	[0m0.0011	0.0041	[94m0.0030	[0m0.0559	0.0497	0.0440	0.0391	14792
Learning rate: 0.00050
--- 1369.942289352417 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0269	[91m0.0230	[0m0.0380	0.0615	[94m0.0039	[0m0.0000	0.0000	0.0000	0.0000	12852

[1mDonor:[0m
0.0316	[91m0.0261	[0m0.0426	0.0675	[94m0.0046	[0m0.0000	0.0000	0.0000	0.0000	12851

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0288	[91m0.0231	[0m0.0383	0.0577	[94m0.0037	[0m0.0000	0.0000	0.0000	0.0000	14792

[1mDonor:[0m
0.0356	[91m0.0282	[0m0.0437	0.0682	[94m0.0048	[0m0.0000	0.0000	0.0000	0.0000	14792
Learning rate: 0.00025
--- 1515.5822355747223 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0003	[91m0.0002	[0m0.0005	0.0019	[94m0.0006	[0m1.0000	1.0000	1.0000	1.0000	12852

[1mDonor:[0m
0.0627	[91m0.0448	[0m0.0602	0.0787	[94m0.0066	[0m0.0000	0.0000	0.0000	0.0000	12851

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0001	[91m0.0001	[0m0.0003	0.0014	[94m0.0006	[0m1.0000	1.0000	1.0000	1.0000	14792

[1mDonor:[0m
0.0650	[91m0.0461	[0m0.0606	0.0786	[94m0.0085	[0m0.0000	0.0000	0.0000	0.0000	14792
Learning rate: 0.00013
--- 1386.2440371513367 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0000	[0m0.0002	0.0005	[94m0.0002	[0m1.0000	1.0000	1.0000	1.0000	12852

[1mDonor:[0m
0.6598	[91m0.4995	[0m0.6721	0.8121	[94m0.4916	[0m0.0000	0.0000	0.0000	0.0000	12851

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0001	[0m0.0001	0.0003	[94m0.0001	[0m1.0000	1.0000	1.0000	1.0000	14792

[1mDonor:[0m
0.6175	[91m0.4756	[0m0.6464	0.7925	[94m0.4595	[0m0.0000	0.0000	0.0000	0.0000	14792
Learning rate: 0.00006
--- 1418.8772101402283 seconds ---
--------------------------------------------------------------
