[1mContext nucleotides: 10000[0m
[1mSequence length (output): 5000[0m
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, 4)]    0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 32)     160         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, None, 32)     128         conv1d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, None, 32)     0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 32)     11296       activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 32)     128         conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, 32)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 32)     11296       activation_1[0][0]               
__________________________________________________________________________________________________
add (Add)                       (None, None, 32)     0           conv1d_3[0][0]                   
                                                                 conv1d[0][0]                     
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 32)     128         add[0][0]                        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, 32)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 32)     11296       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 32)     128         conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, 32)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 32)     11296       activation_3[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 32)     0           conv1d_5[0][0]                   
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 32)     128         add_1[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, 32)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 32)     11296       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 32)     128         conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, 32)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, None, 32)     11296       activation_5[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, 32)     0           conv1d_7[0][0]                   
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, 32)     128         add_2[0][0]                      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, 32)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, None, 32)     11296       activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, 32)     128         conv1d_8[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, 32)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, None, 32)     11296       activation_7[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, 32)     0           conv1d_9[0][0]                   
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, 32)     128         add_3[0][0]                      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, 32)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, None, 32)     11296       activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, 32)     128         conv1d_11[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, 32)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, None, 32)     11296       activation_9[0][0]               
__________________________________________________________________________________________________
add_5 (Add)                     (None, None, 32)     0           conv1d_12[0][0]                  
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, 32)     128         add_5[0][0]                      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, None, 32)     0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, None, 32)     11296       activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, 32)     128         conv1d_13[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, 32)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, None, 32)     11296       activation_11[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, None, 32)     0           conv1d_14[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, None, 32)     128         add_6[0][0]                      
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, 32)     0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, None, 32)     11296       activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, 32)     128         conv1d_15[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, 32)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, None, 32)     11296       activation_13[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, None, 32)     0           conv1d_16[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, None, 32)     128         add_7[0][0]                      
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, 32)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, None, 32)     11296       activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, None, 32)     128         conv1d_17[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, None, 32)     0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, None, 32)     11296       activation_15[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, None, 32)     0           conv1d_18[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, None, 32)     128         add_8[0][0]                      
__________________________________________________________________________________________________
activation_16 (Activation)      (None, None, 32)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, None, 32)     21536       activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, None, 32)     128         conv1d_20[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, None, 32)     0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, None, 32)     21536       activation_17[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, None, 32)     0           conv1d_21[0][0]                  
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, None, 32)     128         add_10[0][0]                     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, None, 32)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, None, 32)     21536       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, None, 32)     128         conv1d_22[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, None, 32)     0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, None, 32)     21536       activation_19[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, None, 32)     0           conv1d_23[0][0]                  
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, None, 32)     128         add_11[0][0]                     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, None, 32)     0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, None, 32)     21536       activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, None, 32)     128         conv1d_24[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, None, 32)     0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, None, 32)     21536       activation_21[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, None, 32)     0           conv1d_25[0][0]                  
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, None, 32)     128         add_12[0][0]                     
__________________________________________________________________________________________________
activation_22 (Activation)      (None, None, 32)     0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, None, 32)     21536       activation_22[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, None, 32)     128         conv1d_26[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, None, 32)     0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, None, 32)     21536       activation_23[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, None, 32)     0           conv1d_27[0][0]                  
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, None, 32)     128         add_13[0][0]                     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, None, 32)     0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, None, 32)     42016       activation_24[0][0]              
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, None, 32)     128         conv1d_29[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, None, 32)     0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, None, 32)     42016       activation_25[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, None, 32)     0           conv1d_30[0][0]                  
                                                                 add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, None, 32)     128         add_15[0][0]                     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, None, 32)     0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, None, 32)     42016       activation_26[0][0]              
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, None, 32)     128         conv1d_31[0][0]                  
__________________________________________________________________________________________________
activation_27 (Activation)      (None, None, 32)     0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, None, 32)     42016       activation_27[0][0]              
__________________________________________________________________________________________________
add_16 (Add)                    (None, None, 32)     0           conv1d_32[0][0]                  
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, None, 32)     128         add_16[0][0]                     
__________________________________________________________________________________________________
activation_28 (Activation)      (None, None, 32)     0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv1d_33 (Conv1D)              (None, None, 32)     42016       activation_28[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, None, 32)     128         conv1d_33[0][0]                  
__________________________________________________________________________________________________
activation_29 (Activation)      (None, None, 32)     0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv1d_34 (Conv1D)              (None, None, 32)     42016       activation_29[0][0]              
__________________________________________________________________________________________________
add_17 (Add)                    (None, None, 32)     0           conv1d_34[0][0]                  
                                                                 add_16[0][0]                     
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, None, 32)     128         add_17[0][0]                     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, None, 32)     0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv1d_35 (Conv1D)              (None, None, 32)     42016       activation_30[0][0]              
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, None, 32)     128         conv1d_35[0][0]                  
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 32)     1056        conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, None, 32)     1056        add_3[0][0]                      
__________________________________________________________________________________________________
activation_31 (Activation)      (None, None, 32)     0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, 32)     0           conv1d_1[0][0]                   
                                                                 conv1d_10[0][0]                  
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, None, 32)     1056        add_8[0][0]                      
__________________________________________________________________________________________________
conv1d_36 (Conv1D)              (None, None, 32)     42016       activation_31[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, None, 32)     0           add_4[0][0]                      
                                                                 conv1d_19[0][0]                  
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, None, 32)     1056        add_13[0][0]                     
__________________________________________________________________________________________________
add_18 (Add)                    (None, None, 32)     0           conv1d_36[0][0]                  
                                                                 add_17[0][0]                     
__________________________________________________________________________________________________
add_14 (Add)                    (None, None, 32)     0           add_9[0][0]                      
                                                                 conv1d_28[0][0]                  
__________________________________________________________________________________________________
conv1d_37 (Conv1D)              (None, None, 32)     1056        add_18[0][0]                     
__________________________________________________________________________________________________
add_19 (Add)                    (None, None, 32)     0           add_14[0][0]                     
                                                                 conv1d_37[0][0]                  
__________________________________________________________________________________________________
cropping1d (Cropping1D)         (None, None, 32)     0           add_19[0][0]                     
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, None, 32)     128         cropping1d[0][0]                 
__________________________________________________________________________________________________
conv1d_38 (Conv1D)              (None, None, 3)      99          batch_normalization_32[0][0]     
==================================================================================================
Total params: 698,915
Trainable params: 696,803
Non-trainable params: 2,112
__________________________________________________________________________________________________
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9703	[91m0.8088	[0m0.9338	0.9685	[94m0.8764	[0m0.7050	0.0923	0.0079	0.0016	11804

[1mDonor:[0m
0.9741	[91m0.8350	[0m0.9559	0.9795	[94m0.9024	[0m0.8962	0.1718	0.0089	0.0016	11803

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9655	[91m0.7863	[0m0.9151	0.9578	[94m0.8537	[0m0.6622	0.0841	0.0084	0.0017	14386

[1mDonor:[0m
0.9682	[91m0.8143	[0m0.9431	0.9750	[94m0.8815	[0m0.8643	0.1613	0.0101	0.0018	14386
Learning rate: 0.00100
--- 1237.1631433963776 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9846	[91m0.8514	[0m0.9538	0.9789	[94m0.9131	[0m0.9998	0.9954	0.9098	0.6022	11804

[1mDonor:[0m
0.9854	[91m0.8683	[0m0.9690	0.9848	[94m0.9294	[0m0.9999	0.9984	0.9531	0.6970	11803

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9800	[91m0.8193	[0m0.9401	0.9724	[94m0.8894	[0m0.9998	0.9953	0.9392	0.7169	14386

[1mDonor:[0m
0.9769	[91m0.8393	[0m0.9559	0.9839	[94m0.9051	[0m0.9999	0.9985	0.9740	0.8265	14386
Learning rate: 0.00100
--- 1362.1708822250366 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9880	[91m0.8908	[0m0.9687	0.9820	[94m0.9403	[0m0.0034	0.0001	0.0000	0.0000	11804

[1mDonor:[0m
0.9890	[91m0.9005	[0m0.9777	0.9881	[94m0.9507	[0m0.0020	0.0000	0.0000	0.0000	11803

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9890	[91m0.8896	[0m0.9725	0.9844	[94m0.9433	[0m0.0028	0.0001	0.0000	0.0000	14386

[1mDonor:[0m
0.9875	[91m0.8895	[0m0.9788	0.9889	[94m0.9451	[0m0.0016	0.0001	0.0000	0.0000	14386
Learning rate: 0.00100
--- 1163.9987678527832 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9568	[91m0.7790	[0m0.9105	0.9527	[94m0.8443	[0m0.9999	0.9997	0.9993	0.9985	11804

[1mDonor:[0m
0.9568	[91m0.8186	[0m0.9475	0.9746	[94m0.8791	[0m0.9995	0.9983	0.9947	0.9886	11803

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9412	[91m0.7630	[0m0.9069	0.9561	[94m0.8300	[0m0.9999	0.9997	0.9993	0.9987	14386

[1mDonor:[0m
0.9523	[91m0.7979	[0m0.9370	0.9726	[94m0.8634	[0m0.9995	0.9985	0.9961	0.9920	14386
Learning rate: 0.00100
--- 1264.24582529068 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0549	[91m0.1473	[0m0.3962	0.6792	[94m0.1477	[0m0.0000	0.0000	0.0000	0.0000	11804

[1mDonor:[0m
0.0986	[91m0.2386	[0m0.5887	0.8521	[94m0.2264	[0m0.0000	0.0000	0.0000	0.0000	11803

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.1198	[91m0.1924	[0m0.4234	0.6847	[94m0.1592	[0m0.0000	0.0000	0.0000	0.0000	14386

[1mDonor:[0m
0.1417	[91m0.2624	[0m0.5712	0.8217	[94m0.2229	[0m0.0000	0.0000	0.0000	0.0000	14386
Learning rate: 0.00100
--- 1107.9464275836945 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0007	[91m0.0013	[0m0.0019	0.0033	[94m0.0003	[0m1.0000	1.0000	0.0000	0.0000	11804

[1mDonor:[0m
0.0012	[91m0.0017	[0m0.0023	0.0027	[94m0.0003	[0m1.0000	0.0000	0.0000	0.0000	11803

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0001	[0m0.0004	0.0010	[94m0.0002	[0m1.0000	0.6067	0.0000	0.0000	14386

[1mDonor:[0m
0.0001	[91m0.0003	[0m0.0006	0.0006	[94m0.0002	[0m1.0000	0.4059	0.0000	0.0000	14386
Learning rate: 0.00100
--- 1201.2123618125916 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0049	[91m0.0042	[0m0.0088	0.0183	[94m0.0038	[0m0.0000	0.0000	0.0000	0.0000	11804

[1mDonor:[0m
0.0025	[91m0.0021	[0m0.0039	0.0074	[94m0.0042	[0m1.0000	1.0000	1.0000	1.0000	11803

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0040	[91m0.0037	[0m0.0074	0.0138	[94m0.0037	[0m0.0000	0.0000	0.0000	0.0000	14386

[1mDonor:[0m
0.0015	[91m0.0016	[0m0.0033	0.0065	[94m0.0038	[0m1.0000	1.0000	1.0000	1.0000	14386
Learning rate: 0.00050
--- 1253.5781390666962 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0002	[91m0.0001	[0m0.0005	0.0010	[94m0.0003	[0m0.0000	0.0000	0.0000	0.0000	11804

[1mDonor:[0m
0.0003	[91m0.0002	[0m0.0005	0.0009	[94m0.0003	[0m1.0000	1.0000	1.0000	1.0000	11803

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0001	[91m0.0001	[0m0.0001	0.0001	[94m0.0002	[0m0.0000	0.0000	0.0000	0.0000	14386

[1mDonor:[0m
0.0001	[91m0.0001	[0m0.0001	0.0001	[94m0.0002	[0m1.0000	1.0000	1.0000	1.0000	14386
Learning rate: 0.00025
--- 1028.7422399520874 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0002	[91m0.0001	[0m0.0005	0.0010	[94m0.0003	[0m0.0000	0.0000	0.0000	0.0000	11804

[1mDonor:[0m
0.0003	[91m0.0002	[0m0.0005	0.0009	[94m0.0003	[0m1.0000	1.0000	1.0000	1.0000	11803

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0001	[91m0.0001	[0m0.0001	0.0001	[94m0.0002	[0m0.0000	0.0000	0.0000	0.0000	14386

[1mDonor:[0m
0.0001	[91m0.0001	[0m0.0001	0.0001	[94m0.0002	[0m1.0000	1.0000	1.0000	1.0000	14386
Learning rate: 0.00013
--- 1157.5689015388489 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0002	[91m0.0001	[0m0.0005	0.0010	[94m0.0003	[0m0.0000	0.0000	0.0000	0.0000	11804

[1mDonor:[0m
0.0003	[91m0.0002	[0m0.0005	0.0009	[94m0.0003	[0m1.0000	1.0000	1.0000	1.0000	11803

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0001	[91m0.0001	[0m0.0001	0.0001	[94m0.0002	[0m0.0000	0.0000	0.0000	0.0000	14386

[1mDonor:[0m
0.0001	[91m0.0001	[0m0.0001	0.0001	[94m0.0002	[0m1.0000	1.0000	1.0000	1.0000	14386
Learning rate: 0.00006
--- 1216.863650560379 seconds ---
--------------------------------------------------------------
