[1mContext nucleotides: 10000[0m
[1mSequence length (output): 5000[0m
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, 4)]    0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 32)     160         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, None, 32)     128         conv1d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, None, 32)     0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 32)     11296       activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 32)     128         conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, 32)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 32)     11296       activation_1[0][0]               
__________________________________________________________________________________________________
add (Add)                       (None, None, 32)     0           conv1d_3[0][0]                   
                                                                 conv1d[0][0]                     
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 32)     128         add[0][0]                        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, 32)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 32)     11296       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 32)     128         conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, 32)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 32)     11296       activation_3[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 32)     0           conv1d_5[0][0]                   
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 32)     128         add_1[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, 32)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 32)     11296       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 32)     128         conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, 32)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, None, 32)     11296       activation_5[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, 32)     0           conv1d_7[0][0]                   
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, 32)     128         add_2[0][0]                      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, 32)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, None, 32)     11296       activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, 32)     128         conv1d_8[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, 32)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, None, 32)     11296       activation_7[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, 32)     0           conv1d_9[0][0]                   
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, 32)     128         add_3[0][0]                      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, 32)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, None, 32)     11296       activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, 32)     128         conv1d_11[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, 32)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, None, 32)     11296       activation_9[0][0]               
__________________________________________________________________________________________________
add_5 (Add)                     (None, None, 32)     0           conv1d_12[0][0]                  
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, 32)     128         add_5[0][0]                      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, None, 32)     0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, None, 32)     11296       activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, 32)     128         conv1d_13[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, 32)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, None, 32)     11296       activation_11[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, None, 32)     0           conv1d_14[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, None, 32)     128         add_6[0][0]                      
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, 32)     0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, None, 32)     11296       activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, 32)     128         conv1d_15[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, 32)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, None, 32)     11296       activation_13[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, None, 32)     0           conv1d_16[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, None, 32)     128         add_7[0][0]                      
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, 32)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, None, 32)     11296       activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, None, 32)     128         conv1d_17[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, None, 32)     0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, None, 32)     11296       activation_15[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, None, 32)     0           conv1d_18[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, None, 32)     128         add_8[0][0]                      
__________________________________________________________________________________________________
activation_16 (Activation)      (None, None, 32)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, None, 32)     21536       activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, None, 32)     128         conv1d_20[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, None, 32)     0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, None, 32)     21536       activation_17[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, None, 32)     0           conv1d_21[0][0]                  
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, None, 32)     128         add_10[0][0]                     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, None, 32)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, None, 32)     21536       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, None, 32)     128         conv1d_22[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, None, 32)     0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, None, 32)     21536       activation_19[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, None, 32)     0           conv1d_23[0][0]                  
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, None, 32)     128         add_11[0][0]                     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, None, 32)     0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, None, 32)     21536       activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, None, 32)     128         conv1d_24[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, None, 32)     0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, None, 32)     21536       activation_21[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, None, 32)     0           conv1d_25[0][0]                  
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, None, 32)     128         add_12[0][0]                     
__________________________________________________________________________________________________
activation_22 (Activation)      (None, None, 32)     0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, None, 32)     21536       activation_22[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, None, 32)     128         conv1d_26[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, None, 32)     0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, None, 32)     21536       activation_23[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, None, 32)     0           conv1d_27[0][0]                  
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, None, 32)     128         add_13[0][0]                     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, None, 32)     0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, None, 32)     42016       activation_24[0][0]              
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, None, 32)     128         conv1d_29[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, None, 32)     0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, None, 32)     42016       activation_25[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, None, 32)     0           conv1d_30[0][0]                  
                                                                 add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, None, 32)     128         add_15[0][0]                     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, None, 32)     0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, None, 32)     42016       activation_26[0][0]              
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, None, 32)     128         conv1d_31[0][0]                  
__________________________________________________________________________________________________
activation_27 (Activation)      (None, None, 32)     0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, None, 32)     42016       activation_27[0][0]              
__________________________________________________________________________________________________
add_16 (Add)                    (None, None, 32)     0           conv1d_32[0][0]                  
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, None, 32)     128         add_16[0][0]                     
__________________________________________________________________________________________________
activation_28 (Activation)      (None, None, 32)     0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv1d_33 (Conv1D)              (None, None, 32)     42016       activation_28[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, None, 32)     128         conv1d_33[0][0]                  
__________________________________________________________________________________________________
activation_29 (Activation)      (None, None, 32)     0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv1d_34 (Conv1D)              (None, None, 32)     42016       activation_29[0][0]              
__________________________________________________________________________________________________
add_17 (Add)                    (None, None, 32)     0           conv1d_34[0][0]                  
                                                                 add_16[0][0]                     
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, None, 32)     128         add_17[0][0]                     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, None, 32)     0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv1d_35 (Conv1D)              (None, None, 32)     42016       activation_30[0][0]              
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, None, 32)     128         conv1d_35[0][0]                  
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 32)     1056        conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, None, 32)     1056        add_3[0][0]                      
__________________________________________________________________________________________________
activation_31 (Activation)      (None, None, 32)     0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, 32)     0           conv1d_1[0][0]                   
                                                                 conv1d_10[0][0]                  
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, None, 32)     1056        add_8[0][0]                      
__________________________________________________________________________________________________
conv1d_36 (Conv1D)              (None, None, 32)     42016       activation_31[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, None, 32)     0           add_4[0][0]                      
                                                                 conv1d_19[0][0]                  
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, None, 32)     1056        add_13[0][0]                     
__________________________________________________________________________________________________
add_18 (Add)                    (None, None, 32)     0           conv1d_36[0][0]                  
                                                                 add_17[0][0]                     
__________________________________________________________________________________________________
add_14 (Add)                    (None, None, 32)     0           add_9[0][0]                      
                                                                 conv1d_28[0][0]                  
__________________________________________________________________________________________________
conv1d_37 (Conv1D)              (None, None, 32)     1056        add_18[0][0]                     
__________________________________________________________________________________________________
add_19 (Add)                    (None, None, 32)     0           add_14[0][0]                     
                                                                 conv1d_37[0][0]                  
__________________________________________________________________________________________________
cropping1d (Cropping1D)         (None, None, 32)     0           add_19[0][0]                     
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, None, 32)     128         cropping1d[0][0]                 
__________________________________________________________________________________________________
conv1d_38 (Conv1D)              (None, None, 3)      99          batch_normalization_32[0][0]     
==================================================================================================
Total params: 698,915
Trainable params: 696,803
Non-trainable params: 2,112
__________________________________________________________________________________________________
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.8860	[91m0.6861	[0m0.8434	0.9273	[94m0.7429	[0m0.9175	0.6586	0.2849	0.0901	13544

[1mDonor:[0m
0.9080	[91m0.7230	[0m0.8857	0.9541	[94m0.7873	[0m0.6220	0.2555	0.0682	0.0184	13544

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.8702	[91m0.6771	[0m0.8429	0.9234	[94m0.7315	[0m0.9155	0.6647	0.2898	0.0920	12384

[1mDonor:[0m
0.9005	[91m0.7154	[0m0.8830	0.9555	[94m0.7784	[0m0.5996	0.2388	0.0649	0.0172	12384
Learning rate: 0.00100
--- 1106.8756613731384 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9725	[91m0.8179	[0m0.9412	0.9750	[94m0.8849	[0m0.9223	0.2576	0.0154	0.0023	13544

[1mDonor:[0m
0.9790	[91m0.8523	[0m0.9639	0.9860	[94m0.9180	[0m0.9145	0.2351	0.0105	0.0013	13544

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9766	[91m0.8425	[0m0.9564	0.9801	[94m0.9067	[0m0.9330	0.2513	0.0131	0.0021	12384

[1mDonor:[0m
0.9826	[91m0.8672	[0m0.9700	0.9872	[94m0.9272	[0m0.9207	0.2204	0.0082	0.0010	12384
Learning rate: 0.00100
--- 1408.3297080993652 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9873	[91m0.8874	[0m0.9733	0.9865	[94m0.9413	[0m0.9985	0.9468	0.3581	0.0848	13544

[1mDonor:[0m
0.9876	[91m0.8986	[0m0.9817	0.9917	[94m0.9521	[0m0.9997	0.9862	0.6214	0.1956	13544

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9872	[91m0.8843	[0m0.9721	0.9866	[94m0.9396	[0m0.9985	0.9448	0.3555	0.0835	12384

[1mDonor:[0m
0.9874	[91m0.8937	[0m0.9803	0.9901	[94m0.9476	[0m0.9997	0.9847	0.6068	0.1981	12384
Learning rate: 0.00100
--- 1310.3955500125885 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9536	[91m0.7905	[0m0.9182	0.9586	[94m0.8497	[0m0.9512	0.8535	0.6868	0.5266	13544

[1mDonor:[0m
0.9189	[91m0.7647	[0m0.9121	0.9595	[94m0.7979	[0m1.0000	1.0000	1.0000	1.0000	13544

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9519	[91m0.7863	[0m0.9159	0.9583	[94m0.8476	[0m0.9481	0.8465	0.6817	0.5245	12384

[1mDonor:[0m
0.9126	[91m0.7637	[0m0.9111	0.9590	[94m0.7902	[0m1.0000	1.0000	1.0000	1.0000	12384
Learning rate: 0.00100
--- 1248.1309728622437 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.8780	[91m0.6530	[0m0.8053	0.8918	[94m0.7076	[0m0.0000	0.0000	0.0000	0.0000	13544

[1mDonor:[0m
0.0003	[91m0.0001	[0m0.0001	0.0001	[94m0.0002	[0m1.0000	1.0000	1.0000	1.0000	13544

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.8463	[91m0.6466	[0m0.8041	0.8935	[94m0.6883	[0m0.0000	0.0000	0.0000	0.0000	12384

[1mDonor:[0m
0.0000	[91m0.0000	[0m0.0000	0.0000	[94m0.0001	[0m1.0000	1.0000	1.0000	1.0000	12384
Learning rate: 0.00100
--- 1124.0461628437042 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0018	[91m0.0017	[0m0.0035	0.0058	[94m0.0017	[0m1.0000	1.0000	1.0000	1.0000	13544

[1mDonor:[0m
0.0769	[91m0.0390	[0m0.0401	0.0442	[94m0.0235	[0m1.0000	1.0000	1.0000	1.0000	13544

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0015	[91m0.0015	[0m0.0023	0.0038	[94m0.0016	[0m1.0000	1.0000	1.0000	1.0000	12384

[1mDonor:[0m
0.0874	[91m0.0443	[0m0.0452	0.0468	[94m0.0257	[0m1.0000	1.0000	1.0000	1.0000	12384
Learning rate: 0.00100
--- 1199.0204186439514 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0371	[91m0.0425	[0m0.0836	0.6412	[94m0.1101	[0m0.0092	0.0064	0.0044	0.0009	13544

[1mDonor:[0m
0.7714	[91m0.6111	[0m0.7861	0.8846	[94m0.5970	[0m1.0000	1.0000	1.0000	1.0000	13544

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0250	[91m0.0272	[0m0.0678	0.5440	[94m0.1017	[0m0.0102	0.0072	0.0047	0.0011	12384

[1mDonor:[0m
0.7474	[91m0.5914	[0m0.7689	0.8793	[94m0.5717	[0m1.0000	1.0000	1.0000	1.0000	12384
Learning rate: 0.00050
--- 1211.3069927692413 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0149	[91m0.0179	[0m0.0799	0.7300	[94m0.1252	[0m0.0001	0.0001	0.0000	0.0000	13544

[1mDonor:[0m
0.6023	[91m0.6057	[0m0.8980	0.9511	[94m0.5570	[0m1.0000	1.0000	1.0000	1.0000	13544

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0297	[91m0.0417	[0m0.1688	0.7086	[94m0.1288	[0m0.0001	0.0000	0.0000	0.0000	12384

[1mDonor:[0m
0.6016	[91m0.5963	[0m0.9075	0.9570	[94m0.5642	[0m1.0000	1.0000	1.0000	1.0000	12384
Learning rate: 0.00025
--- 1224.1768116950989 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9033	[91m0.6861	[0m0.8249	0.8969	[94m0.7391	[0m0.8685	0.4577	0.1725	0.0682	13544

[1mDonor:[0m
0.9272	[91m0.7315	[0m0.8726	0.9372	[94m0.7923	[0m0.1475	0.0204	0.0036	0.0008	13544

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9068	[91m0.6936	[0m0.8320	0.9040	[94m0.7473	[0m0.8701	0.4775	0.1796	0.0708	12384

[1mDonor:[0m
0.9276	[91m0.7343	[0m0.8781	0.9416	[94m0.7975	[0m0.1349	0.0190	0.0034	0.0008	12384
Learning rate: 0.00013
--- 1348.1752352714539 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.8448	[91m0.6835	[0m0.8481	0.9242	[94m0.7073	[0m0.9940	0.9872	0.9747	0.9576	13544

[1mDonor:[0m
0.9690	[91m0.7907	[0m0.9141	0.9560	[94m0.8557	[0m0.9994	0.9981	0.9954	0.9915	13544

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.8398	[91m0.6827	[0m0.8501	0.9218	[94m0.7068	[0m0.9939	0.9872	0.9757	0.9607	12384

[1mDonor:[0m
0.9677	[91m0.7834	[0m0.9097	0.9552	[94m0.8512	[0m0.9994	0.9981	0.9954	0.9917	12384
Learning rate: 0.00006
--- 1226.5908045768738 seconds ---
--------------------------------------------------------------
