[1mContext nucleotides: 10000[0m
[1mSequence length (output): 5000[0m
Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, 4)]    0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, None, 32)     160         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, None, 32)     128         conv1d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, None, 32)     0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 32)     11296       activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 32)     128         conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, 32)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 32)     11296       activation_1[0][0]               
__________________________________________________________________________________________________
add (Add)                       (None, None, 32)     0           conv1d_3[0][0]                   
                                                                 conv1d[0][0]                     
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 32)     128         add[0][0]                        
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, 32)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 32)     11296       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 32)     128         conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, 32)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 32)     11296       activation_3[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, None, 32)     0           conv1d_5[0][0]                   
                                                                 add[0][0]                        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 32)     128         add_1[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, 32)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 32)     11296       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 32)     128         conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, 32)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, None, 32)     11296       activation_5[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, None, 32)     0           conv1d_7[0][0]                   
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, 32)     128         add_2[0][0]                      
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, 32)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, None, 32)     11296       activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, 32)     128         conv1d_8[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, 32)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, None, 32)     11296       activation_7[0][0]               
__________________________________________________________________________________________________
add_3 (Add)                     (None, None, 32)     0           conv1d_9[0][0]                   
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, 32)     128         add_3[0][0]                      
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, 32)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, None, 32)     11296       activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, 32)     128         conv1d_11[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, 32)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, None, 32)     11296       activation_9[0][0]               
__________________________________________________________________________________________________
add_5 (Add)                     (None, None, 32)     0           conv1d_12[0][0]                  
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, 32)     128         add_5[0][0]                      
__________________________________________________________________________________________________
activation_10 (Activation)      (None, None, 32)     0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, None, 32)     11296       activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, 32)     128         conv1d_13[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, 32)     0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, None, 32)     11296       activation_11[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, None, 32)     0           conv1d_14[0][0]                  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, None, 32)     128         add_6[0][0]                      
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, 32)     0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, None, 32)     11296       activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, 32)     128         conv1d_15[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, 32)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, None, 32)     11296       activation_13[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, None, 32)     0           conv1d_16[0][0]                  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, None, 32)     128         add_7[0][0]                      
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, 32)     0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, None, 32)     11296       activation_14[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, None, 32)     128         conv1d_17[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, None, 32)     0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, None, 32)     11296       activation_15[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, None, 32)     0           conv1d_18[0][0]                  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, None, 32)     128         add_8[0][0]                      
__________________________________________________________________________________________________
activation_16 (Activation)      (None, None, 32)     0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, None, 32)     21536       activation_16[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, None, 32)     128         conv1d_20[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, None, 32)     0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, None, 32)     21536       activation_17[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, None, 32)     0           conv1d_21[0][0]                  
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, None, 32)     128         add_10[0][0]                     
__________________________________________________________________________________________________
activation_18 (Activation)      (None, None, 32)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv1d_22 (Conv1D)              (None, None, 32)     21536       activation_18[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, None, 32)     128         conv1d_22[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, None, 32)     0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
conv1d_23 (Conv1D)              (None, None, 32)     21536       activation_19[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, None, 32)     0           conv1d_23[0][0]                  
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, None, 32)     128         add_11[0][0]                     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, None, 32)     0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv1d_24 (Conv1D)              (None, None, 32)     21536       activation_20[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, None, 32)     128         conv1d_24[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, None, 32)     0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv1d_25 (Conv1D)              (None, None, 32)     21536       activation_21[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, None, 32)     0           conv1d_25[0][0]                  
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, None, 32)     128         add_12[0][0]                     
__________________________________________________________________________________________________
activation_22 (Activation)      (None, None, 32)     0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv1d_26 (Conv1D)              (None, None, 32)     21536       activation_22[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, None, 32)     128         conv1d_26[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, None, 32)     0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv1d_27 (Conv1D)              (None, None, 32)     21536       activation_23[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, None, 32)     0           conv1d_27[0][0]                  
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, None, 32)     128         add_13[0][0]                     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, None, 32)     0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv1d_29 (Conv1D)              (None, None, 32)     42016       activation_24[0][0]              
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, None, 32)     128         conv1d_29[0][0]                  
__________________________________________________________________________________________________
activation_25 (Activation)      (None, None, 32)     0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
conv1d_30 (Conv1D)              (None, None, 32)     42016       activation_25[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, None, 32)     0           conv1d_30[0][0]                  
                                                                 add_13[0][0]                     
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, None, 32)     128         add_15[0][0]                     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, None, 32)     0           batch_normalization_26[0][0]     
__________________________________________________________________________________________________
conv1d_31 (Conv1D)              (None, None, 32)     42016       activation_26[0][0]              
__________________________________________________________________________________________________
batch_normalization_27 (BatchNo (None, None, 32)     128         conv1d_31[0][0]                  
__________________________________________________________________________________________________
activation_27 (Activation)      (None, None, 32)     0           batch_normalization_27[0][0]     
__________________________________________________________________________________________________
conv1d_32 (Conv1D)              (None, None, 32)     42016       activation_27[0][0]              
__________________________________________________________________________________________________
add_16 (Add)                    (None, None, 32)     0           conv1d_32[0][0]                  
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
batch_normalization_28 (BatchNo (None, None, 32)     128         add_16[0][0]                     
__________________________________________________________________________________________________
activation_28 (Activation)      (None, None, 32)     0           batch_normalization_28[0][0]     
__________________________________________________________________________________________________
conv1d_33 (Conv1D)              (None, None, 32)     42016       activation_28[0][0]              
__________________________________________________________________________________________________
batch_normalization_29 (BatchNo (None, None, 32)     128         conv1d_33[0][0]                  
__________________________________________________________________________________________________
activation_29 (Activation)      (None, None, 32)     0           batch_normalization_29[0][0]     
__________________________________________________________________________________________________
conv1d_34 (Conv1D)              (None, None, 32)     42016       activation_29[0][0]              
__________________________________________________________________________________________________
add_17 (Add)                    (None, None, 32)     0           conv1d_34[0][0]                  
                                                                 add_16[0][0]                     
__________________________________________________________________________________________________
batch_normalization_30 (BatchNo (None, None, 32)     128         add_17[0][0]                     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, None, 32)     0           batch_normalization_30[0][0]     
__________________________________________________________________________________________________
conv1d_35 (Conv1D)              (None, None, 32)     42016       activation_30[0][0]              
__________________________________________________________________________________________________
batch_normalization_31 (BatchNo (None, None, 32)     128         conv1d_35[0][0]                  
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 32)     1056        conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, None, 32)     1056        add_3[0][0]                      
__________________________________________________________________________________________________
activation_31 (Activation)      (None, None, 32)     0           batch_normalization_31[0][0]     
__________________________________________________________________________________________________
add_4 (Add)                     (None, None, 32)     0           conv1d_1[0][0]                   
                                                                 conv1d_10[0][0]                  
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, None, 32)     1056        add_8[0][0]                      
__________________________________________________________________________________________________
conv1d_36 (Conv1D)              (None, None, 32)     42016       activation_31[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, None, 32)     0           add_4[0][0]                      
                                                                 conv1d_19[0][0]                  
__________________________________________________________________________________________________
conv1d_28 (Conv1D)              (None, None, 32)     1056        add_13[0][0]                     
__________________________________________________________________________________________________
add_18 (Add)                    (None, None, 32)     0           conv1d_36[0][0]                  
                                                                 add_17[0][0]                     
__________________________________________________________________________________________________
add_14 (Add)                    (None, None, 32)     0           add_9[0][0]                      
                                                                 conv1d_28[0][0]                  
__________________________________________________________________________________________________
conv1d_37 (Conv1D)              (None, None, 32)     1056        add_18[0][0]                     
__________________________________________________________________________________________________
add_19 (Add)                    (None, None, 32)     0           add_14[0][0]                     
                                                                 conv1d_37[0][0]                  
__________________________________________________________________________________________________
cropping1d (Cropping1D)         (None, None, 32)     0           add_19[0][0]                     
__________________________________________________________________________________________________
batch_normalization_32 (BatchNo (None, None, 32)     128         cropping1d[0][0]                 
__________________________________________________________________________________________________
conv1d_38 (Conv1D)              (None, None, 3)      99          batch_normalization_32[0][0]     
==================================================================================================
Total params: 698,915
Trainable params: 696,803
Non-trainable params: 2,112
__________________________________________________________________________________________________
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9728	[91m0.8145	[0m0.9368	0.9728	[94m0.8843	[0m0.9742	0.5981	0.0701	0.0098	14762

[1mDonor:[0m
0.9739	[91m0.8371	[0m0.9554	0.9815	[94m0.9034	[0m0.9602	0.4593	0.0362	0.0053	14762

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9700	[91m0.8268	[0m0.9497	0.9782	[94m0.8929	[0m0.9721	0.5377	0.0451	0.0064	13381

[1mDonor:[0m
0.9749	[91m0.8461	[0m0.9655	0.9877	[94m0.9124	[0m0.9592	0.4157	0.0250	0.0037	13381
Learning rate: 0.00100
--- 1332.737833738327 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9869	[91m0.8710	[0m0.9696	0.9851	[94m0.9330	[0m0.9862	0.7386	0.0911	0.0124	14762

[1mDonor:[0m
0.9883	[91m0.8853	[0m0.9773	0.9886	[94m0.9432	[0m0.9926	0.8281	0.1242	0.0171	14762

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9822	[91m0.8843	[0m0.9775	0.9902	[94m0.9404	[0m0.9847	0.6856	0.0531	0.0070	13381

[1mDonor:[0m
0.9855	[91m0.8978	[0m0.9841	0.9927	[94m0.9496	[0m0.9926	0.8185	0.0790	0.0099	13381
Learning rate: 0.00100
--- 1229.2956771850586 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9888	[91m0.8756	[0m0.9676	0.9841	[94m0.9341	[0m0.0000	0.0000	0.0000	0.0000	14762

[1mDonor:[0m
0.9892	[91m0.8855	[0m0.9778	0.9890	[94m0.9439	[0m0.0000	0.0000	0.0000	0.0000	14762

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9854	[91m0.8895	[0m0.9793	0.9892	[94m0.9444	[0m0.0000	0.0000	0.0000	0.0000	13381

[1mDonor:[0m
0.9836	[91m0.8999	[0m0.9861	0.9939	[94m0.9511	[0m0.0000	0.0000	0.0000	0.0000	13381
Learning rate: 0.00100
--- 1308.7846057415009 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9390	[91m0.7733	[0m0.9166	0.9602	[94m0.8381	[0m1.0000	1.0000	0.9999	0.9998	14762

[1mDonor:[0m
0.9757	[91m0.8424	[0m0.9509	0.9755	[94m0.9040	[0m0.9999	0.9993	0.9976	0.9950	14762

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9522	[91m0.8015	[0m0.9369	0.9731	[94m0.8654	[0m1.0000	1.0000	0.9999	0.9996	13381

[1mDonor:[0m
0.9710	[91m0.8594	[0m0.9661	0.9842	[94m0.9169	[0m0.9998	0.9992	0.9971	0.9938	13381
Learning rate: 0.00100
--- 1136.2522420883179 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0489	[91m0.0505	[0m0.1009	0.1974	[94m0.0491	[0m1.0000	1.0000	1.0000	1.0000	14762

[1mDonor:[0m
0.9466	[91m0.7538	[0m0.8988	0.9586	[94m0.8259	[0m0.0057	0.0022	0.0010	0.0005	14762

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0634	[91m0.0686	[0m0.1399	0.2817	[94m0.0681	[0m1.0000	1.0000	1.0000	1.0000	13381

[1mDonor:[0m
0.9526	[91m0.7826	[0m0.9312	0.9749	[94m0.8558	[0m0.0056	0.0020	0.0008	0.0004	13381
Learning rate: 0.00100
--- 1176.4926483631134 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0000	[0m0.0000	0.0002	[94m0.0001	[0m1.0000	1.0000	1.0000	1.0000	14762

[1mDonor:[0m
0.7244	[91m0.5590	[0m0.7321	0.8581	[94m0.5719	[0m0.0000	0.0000	0.0000	0.0000	14762

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0004	[91m0.0006	[0m0.0009	0.0013	[94m0.0002	[0m1.0000	1.0000	1.0000	1.0000	13381

[1mDonor:[0m
0.7701	[91m0.5994	[0m0.7826	0.8998	[94m0.6253	[0m0.0000	0.0000	0.0000	0.0000	13381
Learning rate: 0.00100
--- 1018.1295964717865 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.7920	[91m0.5965	[0m0.7681	0.8774	[94m0.6319	[0m0.9768	0.9625	0.9389	0.9034	14762

[1mDonor:[0m
0.7235	[91m0.5562	[0m0.7331	0.8663	[94m0.5754	[0m0.9969	0.9954	0.9928	0.9881	14762

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.8383	[91m0.6390	[0m0.8130	0.9135	[94m0.6887	[0m0.9747	0.9561	0.9250	0.8786	13381

[1mDonor:[0m
0.7628	[91m0.5958	[0m0.7874	0.9099	[94m0.6288	[0m0.9966	0.9947	0.9911	0.9842	13381
Learning rate: 0.00050
--- 1389.2602775096893 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.0007	[91m0.0010	[0m0.0017	0.0023	[94m0.0011	[0m0.0000	0.0000	0.0000	0.0000	14762

[1mDonor:[0m
0.0000	[91m0.0000	[0m0.0000	0.0002	[94m0.0001	[0m1.0000	1.0000	1.0000	1.0000	14762

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.0000	[91m0.0000	[0m0.0001	0.0008	[94m0.0013	[0m0.0000	0.0000	0.0000	0.0000	13381

[1mDonor:[0m
0.0010	[91m0.0006	[0m0.0010	0.0016	[94m0.0002	[0m1.0000	1.0000	1.0000	1.0000	13381
Learning rate: 0.00025
--- 1164.6833655834198 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.8619	[91m0.6795	[0m0.8567	0.9369	[94m0.7331	[0m0.0000	0.0000	0.0000	0.0000	14762

[1mDonor:[0m
0.0003	[91m0.0001	[0m0.0001	0.0017	[94m0.0005	[0m1.0000	1.0000	1.0000	1.0000	14762

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.8868	[91m0.7137	[0m0.8865	0.9525	[94m0.7710	[0m0.0000	0.0000	0.0000	0.0000	13381

[1mDonor:[0m
0.0006	[91m0.0009	[0m0.0016	0.0034	[94m0.0007	[0m1.0000	1.0000	1.0000	1.0000	13381
Learning rate: 0.00013
--- 1170.1763279438019 seconds ---
--------------------------------------------------------------
--------------------------------------------------------------

[1mValidation set metrics:[0m

[1mAcceptor:[0m
0.9397	[91m0.7555	[0m0.9094	0.9608	[94m0.8255	[0m0.9905	0.9785	0.9560	0.9206	14762

[1mDonor:[0m
0.9317	[91m0.7441	[0m0.8877	0.9386	[94m0.8055	[0m0.9968	0.9936	0.9856	0.9709	14762

[1mTraining set metrics:[0m

[1mAcceptor:[0m
0.9453	[91m0.7856	[0m0.9366	0.9736	[94m0.8521	[0m0.9899	0.9758	0.9446	0.8958	13381

[1mDonor:[0m
0.9369	[91m0.7728	[0m0.9166	0.9579	[94m0.8345	[0m0.9967	0.9927	0.9809	0.9583	13381
Learning rate: 0.00006
--- 1234.603731393814 seconds ---
--------------------------------------------------------------
